const dict = {
	locales: {
		en: "English",
		fa: "فارسی",
		ar: "العربية",
		de: "Deutsch",
		ru: "Русский",
		hi: "हिन्दी",
	},
	general: {
		appName: "نات بوست",
		members: "{count} عضو",
		subscribers: "{count} مشترک",
	},
	pages: {
		error: {
			title: "خطا",
			description: "خطایی رخ داد.",
			data: {
				error: {
					title: "مشکلی پیش آمد",
					description:
						"نتوانستیم داده‌ها را دریافت کنیم، برنامه را مجدداً بارگذاری کنید.",
				},
			},
		},
		errorInvalidEnv: {
			title: "محیط نامعتبر",
			description:
				"این برنامه برای اجرا در محیط مینی‌اپ‌های تلگرام طراحی شده است.",
		},
		intro: {
			sections: {
				intro: {
					title: "نات بوست",
					description:
						"یک بازار تبلیغاتی منصفانه، امن و خودکار برای تلگرام. تبلیغات شما، قوانین شما.",
				},
				advertisers: {
					title: "تبلیغ‌دهندگان",
					description:
						"با اطمینان کمپین راه‌اندازی کنید. ضمانت تضمین می‌کند پرداخت‌های شما تا زمان ارائه نتایج در امان باشند.",
				},
				publishers: {
					title: "ناشران",
					description:
						"به‌صورت امن و به‌موقع دریافت کنید. جریان خودکار ما شفافیت و عدالت را برای هر تبلیغ تضمین می‌کند.",
				},
				flow: {
					title: "شفافیت",
					description:
						"هر مرحله ردیابی می‌شود. پرداخت‌های تضمین‌شده. فرآیندهای خودکاری که برای هر دو طرف کار می‌کنند.",
				},
				done: {
					title: "آماده‌اید؟",
					description:
						"تبلیغات را شروع کنید یا از کانال خود با اطمینان کامل و بدون دردسر کسب درآمد کنید.",
				},
			},
			button: {
				start: "شروع کنیم",
			},
		},
		home: {},
		advertisers: {
			title: "تبلیغ‌دهندگان",
			tabs: {
				all: "همه",
				ready: "آماده",
				pending: "در انتظار",
				disabled: "غیرفعال",
			},
			items: {
				empty: {
					title: "هنوز کمپینی ندارید",
					subtitle: "چیزی برای دیدن نیست",
					description: "بیایید اولین کمپین خود را ایجاد کنیم.",
					button: "ایجاد کمپین",
					search: {
						title: "چیزی یافت نشد",
						description: "هیچ کمپینی با {query} مطابقت نداشت.",
					},
				},
			},
		},
		publishers: {
			title: "ناشران",
			tabs: {
				all: "همه",
				active: "فعال",
				inactive: "غیرفعال",
				verified: "تایید شده",
			},
			items: {
				empty: {
					title: "هنوز چیزی نیست",
					subtitle: "چیزی برای دیدن نیست",
					description: "بیایید کانال/ابرگروه خود را اضافه کنیم.",
					button: "شروع کسب درآمد",
					search: {
						title: "یافت نشد",
						description: "نتیجه‌ای برای {query} یافت نشد.",
					},
				},
			},
		},
		entity: {
			tabs: {
				overview: {
					title: "نمای کلی",
				},
				statistics: {
					title: "آمار",
				},
			},
			overview: {
				title: {
					channel: "آمار کانال",
					group: "آمار گروه",
				},
				range: "{from} - {to}",
				channel: {
					followers: {
						label: "دنبال‌کنندگان",
					},
					viewsPerPost: {
						label: "بازدید هر پست",
					},
					reactionsPerPost: {
						label: "واکنش‌ها هر پست",
					},
					sharesPerPost: {
						label: "اشتراک‌گذاری هر پست",
					},
					viewsPerStory: {
						label: "بازدید هر استوری",
					},
					sharesPerStory: {
						label: "اشتراک‌گذاری هر استوری",
					},
					enabledNotifications: {
						label: "اعلان‌های فعال",
					},
					premiumAudience: {
						label: "مشترکین پریمیوم",
					},
				},
				group: {
					members: {
						label: "اعضا",
					},
					messages: {
						label: "پیام‌ها",
					},
					viewingMembers: {
						label: "اعضای در حال مشاهده",
					},
					postingMembers: {
						label: "اعضای در حال ارسال",
					},
					premiumAudience: {
						label: "اعضای پریمیوم",
					},
				},
				empty: {
					text: "آمار در دسترس نیست.",
				},
			},
			infolist: {
				language: {
					label: "زبان",
					undefined: "تنظیم نشده",
				},
				category: {
					label: "دسته‌بندی",
					undefined: "تنظیم نشده",
				},
				status: {
					label: "وضعیت",
					status: {
						active: "فعال",
						inactive: "غیرفعال",
					},
				},
				verification: {
					label: "تاییدیه",
					status: {
						verified: "تایید شده",
						unverified: "تایید نشده",
					},
				},
			},
			options: {
				title: {
					channel: "تنظیمات کانال",
					supergroup: "تنظیمات گروه",
				},
				section: {
					category: {
						label: "دسته‌بندی",
						picker: "انتخاب دسته‌بندی",
						undefined: "تنظیم نشده",
					},
					language: {
						label: "زبان",
						picker: "انتخاب زبان",
						undefined: "تنظیم نشده",
					},
					status: {
						label: "وضعیت",
					},
					verification: {
						label: "تاییدیه",
						verified: "تایید شده",
						apply: "درخواست تاییدیه",
					},
				},
			},
			statistics: {
				charts: {
					channel: {
						growth: {
							title: "رشد",
						},
						followers: {
							title: "دنبال‌کنندگان",
						},
						notifications: {
							title: "اعلان‌ها",
						},
						viewsByHours: {
							title: "بازدید بر اساس ساعت (UTC)",
						},
						viewsBySource: {
							title: "بازدید بر اساس منبع",
						},
						followersBySource: {
							title: "دنبال‌کنندگان بر اساس منبع",
						},
						languages: {
							title: "زبان‌ها",
						},
						interactions: {
							title: "تعاملات",
						},
						reactionsByEmotion: {
							title: "واکنش‌ها بر اساس احساسات",
						},
					},
					group: {
						growth: {
							title: "رشد",
						},
						members: {
							title: "اعضای گروه",
						},
						newMembersBySource: {
							title: "اعضای جدید بر اساس منبع",
						},
						membersPrimaryLanguage: {
							title: "زبان اصلی اعضا",
						},
						messages: {
							title: "پیام‌ها",
						},
						actions: {
							title: "اقدامات",
						},
						topHours: {
							title: "ساعت‌های پرترافیک",
						},
						topDaysOfWeek: {
							title: "روزهای پرترافیک هفته",
						},
					},
				},
			},
			ads: {
				types: {
					"channel-post": {
						title: "پست کانال",
						description:
							"تبلیغ در کانال منتشر می‌شود و برای مدت انتخاب شده قابل مشاهده است.",
					},
					"channel-story": {
						title: "استوری کانال",
						description:
							"تبلیغ به عنوان استوری کانال نمایش داده می‌شود و برای مدت انتخاب شده فعال می‌ماند.",
					},
					"group-pin": {
						title: "پست سنجاق شده گروه",
						description:
							"تبلیغ در گروه ارسال و برای مدت انتخاب شده در بالا سنجاق می‌شود.",
					},
				},
				options: {
					active: {
						label: "فعال",
					},
					maxPeriod: {
						label: "حداکثر دوره",
					},
					unit: {
						label: "حداقل واحد",
					},
					price: {
						label: "قیمت هر ساعت",
						placeholder: "۱ تون",
					},
				},
				inactive: {
					text: "پس از راه‌اندازی در دسترس است.",
				},
				unavailable: {
					title: "تبلیغات در دسترس نیست",
					description: "تبلیغات در حال حاضر در دسترس نیستند.",
				},
			},
			footer: {
				view: {
					channel: {
						text: "مشاهده کانال",
					},
					supergroup: {
						text: "مشاهده گروه",
					},
				},
				share: {
					text: "📣 بیایید {name} را در بازار تبلیغات {app_name} ببینیم!",
				},
				offer: {
					text: "ایجاد پیشنهاد",
				},
			},
			order: {
				hours: "{amount} ساعت /",
			},
		},
		campaign: {
			hint: {
				text: "می‌توانید کمپین را غیرفعال کنید تا دریافت پیشنهاد متوقف شود.",
			},
			footer: {
				button: {
					set: "تنظیم بنر",
					share: "اشتراک‌گذاری",
					disable: "غیرفعال کردن",
					enable: "فعال کردن",
					offer: "ایجاد پیشنهاد",
				},
				text: {
					disabled: "کمپین فعال نیست.",
				},
				set: {
					title: "بنر کمپین",
					message:
						"پس از بستن برنامه، در ربات ادامه دهید تا بنر خود را اضافه کنید.",
				},
				share: {
					text: "📣 بیایید {name} را در بازار تبلیغات {app_name} ببینیم!",
				},
			},
			viewer: {
				description: {
					empty: "توضیحی وجود ندارد.",
				},
			},
		},
		void: {
			title: "خلاء",
			subtitle: "این صفحه خلاء است",
			description:
				"هنوز محتوای کافی برای پر کردن این صفحه نداریم—هنوز MVP است. در حال حاضر، از این آثار هنری پیکسلی تصادفی تولید شده با الگوریتم لذت ببرید <3",
		},
		balance: {
			title: "موجودی",
			wallet: {
				connected: {
					title: "کیف پول متصل شد",
					button: "قطع اتصال",
				},
				connect: {
					title: "کیف پول خود را متصل کنید",
					button: "اتصال",
				},
			},
			balance: {
				total: "کل موجودی",
				pending: "موجودی در انتظار: {amount}",
				description: "نمی‌توانید موجودی در انتظار را برداشت کنید.",
			},
			deposit: {
				button: "واریز",
			},
			withdraw: {
				button: "برداشت",
			},
			transactions: {
				title: "تاریخچه تراکنش‌ها",
			},
			soon: {
				title: "به زودی",
				description:
					"در حال حاضر برای اهداف تست با سیستم موجودی داخلی کار می‌کنیم، نه به خاطر اینکه من در بلاکچین ضعیفم یا چیزی، ما می‌توانیم سیستم پرداخت ربات Contest را در زمان راه‌اندازی تولید کپی-پیست کنیم.",
				buttons: {
					ok: "خب، باشه",
					ohok: "آهان، باشه",
					okok: "باشه باشه!",
				},
			},
		},
	},
	components: {
		bottomBar: {
			items: {
				home: {
					title: "خانه",
				},
				advertisers: {
					title: "تبلیغ‌دهندگان",
				},
				publishers: {
					title: "ناشران",
				},
				profile: {
					title: "پروفایل",
				},
			},
			search: {
				title: "جستجو",
			},
		},
		telegramChart: {
			all: "همه",
			zoomOut: "کوچک‌نمایی",
		},
		datepicker: {
			notSet: "تنظیم نشده",
		},
	},
	modals: {
		publishersAdd: {
			title: {
				channel: "کسب درآمد از کانال شما",
				group: "کسب درآمد از ابرگروه شما",
			},
			description:
				"ربات را به عنوان مدیر به چت خود اضافه کنید و دسترسی‌های زیر را اعطا کنید:",
			permissions: {
				post: {
					title: "ارسال پیام",
					description: "اجازه راه‌اندازی خودکار تبلیغات را می‌دهد.",
				},
				edit: {
					title: "ویرایش پیام",
					description: "برای ویرایش تبلیغات در صورت نیاز استفاده می‌شود.",
				},
				delete: {
					title: "حذف پیام",
					description: "برای حذف تبلیغات در صورت لزوم استفاده می‌شود.",
				},
				promote: {
					title: "افزودن مدیر جدید",
					description: "برای اضافه کردن ربات تحلیلگر لازم است.",
				},
				pin: {
					title: "سنجاق کردن پیام",
					description: "برای سنجاق کردن تبلیغات لازم است.",
				},
				restrict: {
					title: "محدود کردن اعضا",
					description: "برای دسترسی به تحلیل گروه لازم است.",
				},
			},
			toggle: {
				channel: "به جای آن از یک ابرگروه کسب درآمد کنید؟",
				group: "به جای آن از یک کانال کسب درآمد کنید؟",
			},
			button: {
				channel: "اتصال کانال",
				group: "اتصال ابرگروه",
			},
		},
		campaignsAdd: {
			title: {
				text: "ایجاد کمپین",
			},
			button: {
				text: "ایجاد کمپین",
			},
			section: {
				fields: {
					name: {
						placeholder: "نام کمپین",
					},
					description: {
						placeholder: "توضیحات کمپین",
					},
				},
				description: "برای آپلود بنر کمپین خود به ربات هدایت می‌شوید.",
			},
			success: {
				title: "✅ کمپین ایجاد شد",
				message:
					"کمپین شما ایجاد شد. پس از بستن برنامه، در ربات ادامه دهید تا بنر خود را اضافه کنید.",
			},
		},
		campaignsOffer: {
			title: "ارسال پیشنهاد به کمپین",
			description:
				"یک کانال یا گروه فعال را انتخاب کنید تا به این کمپین ابراز علاقه کنید و به صاحب کمپین اطلاع دهید.",
			entity: {
				label: "کانال / ابرگروه",
				undefined: "انتخاب نشده",
			},
			hint: "شما {count} چت واجد شرایط دارید.",
			button: {
				send: "ارسال پیشنهاد",
			},
			success: {
				title: "✅ پیشنهاد ارسال شد",
				message: "پیشنهاد شما با موفقیت ارسال شد.",
			},
		},
		entitiesOffer: {
			campaign: {
				label: "کمپین",
				undefined: "انتخاب نشده",
			},
			start: {
				label: "تاریخ شروع",
			},
			duration: {
				label: "مدت زمان",
				hours: "{hours} ساعت",
			},
			price: {
				label: "قیمت",
			},
			hint: "شما {count} کمپین واجد شرایط دارید.",
			button: {
				send: "ارسال پیشنهاد",
			},
			success: {
				title: "✅ پیشنهاد ارسال شد",
				message:
					"پیشنهاد شما با موفقیت ارسال شد. می‌توانید با صاحب آن از طریق ربات چت کنید.",
			},
			unsupported: {
				title: "در حال حاضر پشتیبانی نمی‌شود",
				message:
					"این نوع تبلیغ برای پیشنهادات پشتیبانی نمی‌شود. ماکسیم مهلت را به اندازه کافی تمدید نکرد. فعلاً پست‌های کانال را امتحان کنید.",
			},
			insufficientBalance: {
				title: "موجودی ناکافی",
				message:
					"شما موجودی کافی برای ارسال این پیشنهاد ندارید. لطفاً موجودی خود را افزایش دهید و دوباره تلاش کنید.",
			},
		},
		verification: {
			title: "درخواست تاییدیه",
			description:
				"می‌توانید از تیم پشتیبانی ما درخواست کنید تا چت یا کمپین شما را تایید کند. موجودیت‌های تایید شده در صفحه اصلی فهرست می‌شوند.",
			button: {
				support: "تماس با پشتیبانی",
			},
		},
		settings: {
			title: "تنظیمات",
			language: "زبان",
			haptic: "بازخورد لمسی",
			reset: "بازنشانی داده‌های برنامه",
			click: "کلیک کن!",
			footer: "$ساخته شده توسط Contest برای Contest",
		},
	},
};

export { dict };
